export const CityData = [
  {
    "id": "35",
    "label": "北京市",
    "value": "110000",
    "children": [
      {
        "id": "1022",
        "label": "市辖区",
        "value": "110100",
      },
      {
        "id": "1023",
        "label": "县",
        "value": "110200",
      }
    ]
  },
  {
    "id": "1",
    "label": "上海市",
    "value": "310000",
    "children": [
      {
        "id": "1096",
        "label": "市辖区",
        "value": "310100",
      },
      {
        "id": "1097",
        "label": "县",
        "value": "310200",
      }
    ]
  },
  {
    "id": "2",
    "label": "天津市",
    "value": "120000",
    "children": [
      {
        "id": "1024",
        "label": "市辖区",
        "value": "120100",
      },
      {
        "id": "1025",
        "label": "县",
        "value": "120200",
      }
    ]
  },
  {
    "id": "3",
    "label": "重庆市",
    "value": "500000",
    "children": [
      {
        "id": "1260",
        "label": "市辖区",
        "value": "500100",
      },
      {
        "id": "1261",
        "label": "县",
        "value": "500200",
      }
    ]
  },
  {
    "id": "4",
    "label": "河北省",
    "value": "130000",
    "children": [
      {
        "id": "1026",
        "label": "石家庄市",
        "value": "130100",
      },
      {
        "id": "1027",
        "label": "唐山市",
        "value": "130200",
      },
      {
        "id": "1028",
        "label": "秦皇岛市",
        "value": "130300",
      },
      {
        "id": "1029",
        "label": "邯郸市",
        "value": "130400",
      },
      {
        "id": "1030",
        "label": "邢台市",
        "value": "130500",
      },
      {
        "id": "1031",
        "label": "保定市",
        "value": "130600",
      },
      {
        "id": "1032",
        "label": "张家口市",
        "value": "130700",
      },
      {
        "id": "1033",
        "label": "承德市",
        "value": "130800",
      },
      {
        "id": "1034",
        "label": "沧州市",
        "value": "130900",
      },
      {
        "id": "1035",
        "label": "廊坊市",
        "value": "131000",
      },
      {
        "id": "1036",
        "label": "衡水市",
        "value": "131100",
      }
    ]
  },
  {
    "id": "5",
    "label": "山西省",
    "value": "140000",
    "children": [
      {
        "id": "1037",
        "label": "太原市",
        "value": "140100",
      },
      {
        "id": "1038",
        "label": "大同市",
        "value": "140200",
      },
      {
        "id": "1039",
        "label": "阳泉市",
        "value": "140300",
      },
      {
        "id": "1040",
        "label": "长治市",
        "value": "140400",
      },
      {
        "id": "1041",
        "label": "晋城市",
        "value": "140500",
      },
      {
        "id": "1042",
        "label": "朔州市",
        "value": "140600",
      },
      {
        "id": "1043",
        "label": "晋中市",
        "value": "140700",
      },
      {
        "id": "1044",
        "label": "运城市",
        "value": "140800",
      },
      {
        "id": "1045",
        "label": "忻州市",
        "value": "140900",
      },
      {
        "id": "1046",
        "label": "临汾市",
        "value": "141000",
      },
      {
        "id": "1047",
        "label": "吕梁市",
        "value": "141100",
      }
    ]
  },
  {
    "id": "6",
    "label": "内蒙古",
    "value": "150000",
    "children": [
      {
        "id": "1048",
        "label": "呼和浩特市",
        "value": "150100",
      },
      {
        "id": "1049",
        "label": "包头市",
        "value": "150200",
      },
      {
        "id": "1050",
        "label": "乌海市",
        "value": "150300",
      },
      {
        "id": "1051",
        "label": "赤峰市",
        "value": "150400",
      },
      {
        "id": "1052",
        "label": "通辽市",
        "value": "150500",
      },
      {
        "id": "1053",
        "label": "鄂尔多斯市",
        "value": "150600",
      },
      {
        "id": "1054",
        "label": "呼伦贝尔市",
        "value": "150700",
      },
      {
        "id": "1055",
        "label": "巴彦淖尔市",
        "value": "150800",
      },
      {
        "id": "1056",
        "label": "乌兰察布市",
        "value": "150900",
      },
      {
        "id": "1057",
        "label": "兴安盟",
        "value": "152200",
      },
      {
        "id": "1058",
        "label": "锡林郭勒盟",
        "value": "152500",
      },
      {
        "id": "1059",
        "label": "阿拉善盟",
        "value": "152900",
      }
    ]
  },
  {
    "id": "7",
    "label": "辽宁省",
    "value": "210000",
    "children": [
      {
        "id": "1060",
        "label": "沈阳市",
        "value": "210100",
      },
      {
        "id": "1061",
        "label": "大连市",
        "value": "210200",
      },
      {
        "id": "1062",
        "label": "鞍山市",
        "value": "210300",
      },
      {
        "id": "1063",
        "label": "抚顺市",
        "value": "210400",
      },
      {
        "id": "1064",
        "label": "本溪市",
        "value": "210500",
      },
      {
        "id": "1065",
        "label": "丹东市",
        "value": "210600",
      },
      {
        "id": "1066",
        "label": "锦州市",
        "value": "210700",
      },
      {
        "id": "1067",
        "label": "营口市",
        "value": "210800",
      },
      {
        "id": "1068",
        "label": "阜新市",
        "value": "210900",
      },
      {
        "id": "1069",
        "label": "辽阳市",
        "value": "211000",
      },
      {
        "id": "1070",
        "label": "盘锦市",
        "value": "211100",
      },
      {
        "id": "1071",
        "label": "铁岭市",
        "value": "211200",
      },
      {
        "id": "1072",
        "label": "朝阳市",
        "value": "211300",
      },
      {
        "id": "1073",
        "label": "葫芦岛市",
        "value": "211400",
      }
    ]
  },
  {
    "id": "8",
    "label": "吉林省",
    "value": "220000",
    "children": [
      {
        "id": "1074",
        "label": "长春市",
        "value": "220100",
      },
      {
        "id": "1075",
        "label": "吉林市",
        "value": "220200",
      },
      {
        "id": "1076",
        "label": "四平市",
        "value": "220300",
      },
      {
        "id": "1077",
        "label": "辽源市",
        "value": "220400",
      },
      {
        "id": "1078",
        "label": "通化市",
        "value": "220500",
      },
      {
        "id": "1079",
        "label": "白山市",
        "value": "220600",
      },
      {
        "id": "1080",
        "label": "松原市",
        "value": "220700",
      },
      {
        "id": "1081",
        "label": "白城市",
        "value": "220800",
      },
      {
        "id": "1082",
        "label": "延边朝鲜族自治州",
        "value": "222400",
      }
    ]
  },
  {
    "id": "9",
    "label": "黑龙江省",
    "value": "230000",
    "children": [
      {
        "id": "1083",
        "label": "哈尔滨市",
        "value": "230100",
      },
      {
        "id": "1084",
        "label": "齐齐哈尔市",
        "value": "230200",
      },
      {
        "id": "1085",
        "label": "鸡西市",
        "value": "230300",
      },
      {
        "id": "1086",
        "label": "鹤岗市",
        "value": "230400",
      },
      {
        "id": "1087",
        "label": "双鸭山市",
        "value": "230500",
      },
      {
        "id": "1088",
        "label": "大庆市",
        "value": "230600",
      },
      {
        "id": "1089",
        "label": "伊春市",
        "value": "230700",
      },
      {
        "id": "1090",
        "label": "佳木斯市",
        "value": "230800",
      },
      {
        "id": "1091",
        "label": "七台河市",
        "value": "230900",
      },
      {
        "id": "1092",
        "label": "牡丹江市",
        "value": "231000",
      },
      {
        "id": "1093",
        "label": "黑河市",
        "value": "231100",
      },
      {
        "id": "1094",
        "label": "绥化市",
        "value": "231200",
      },
      {
        "id": "1095",
        "label": "大兴安岭地区",
        "value": "232700",
      }
    ]
  },
  {
    "id": "10",
    "label": "江苏省",
    "value": "320000",
    "children": [
      {
        "id": "1098",
        "label": "南京市",
        "value": "320100",
      },
      {
        "id": "1099",
        "label": "无锡市",
        "value": "320200",
      },
      {
        "id": "1100",
        "label": "徐州市",
        "value": "320300",
      },
      {
        "id": "1101",
        "label": "常州市",
        "value": "320400",
      },
      {
        "id": "1102",
        "label": "苏州市",
        "value": "320500",
      },
      {
        "id": "1103",
        "label": "南通市",
        "value": "320600",
      },
      {
        "id": "1104",
        "label": "连云港市",
        "value": "320700",
      },
      {
        "id": "1105",
        "label": "淮安市",
        "value": "320800",
      },
      {
        "id": "1106",
        "label": "盐城市",
        "value": "320900",
      },
      {
        "id": "1107",
        "label": "扬州市",
        "value": "321000",
      },
      {
        "id": "1108",
        "label": "镇江市",
        "value": "321100",
      },
      {
        "id": "1109",
        "label": "泰州市",
        "value": "321200",
      },
      {
        "id": "1110",
        "label": "宿迁市",
        "value": "321300",
      }
    ]
  },
  {
    "id": "11",
    "label": "浙江省",
    "value": "330000",
    "children": [
      {
        "id": "1111",
        "label": "杭州市",
        "value": "330100",
      },
      {
        "id": "1112",
        "label": "宁波市",
        "value": "330200",
      },
      {
        "id": "1113",
        "label": "温州市",
        "value": "330300",
      },
      {
        "id": "1114",
        "label": "嘉兴市",
        "value": "330400",
      },
      {
        "id": "1115",
        "label": "湖州市",
        "value": "330500",
      },
      {
        "id": "1116",
        "label": "绍兴市",
        "value": "330600",
      },
      {
        "id": "1117",
        "label": "金华市",
        "value": "330700",
      },
      {
        "id": "1118",
        "label": "衢州市",
        "value": "330800",
      },
      {
        "id": "1119",
        "label": "舟山市",
        "value": "330900",
      },
      {
        "id": "1120",
        "label": "台州市",
        "value": "331000",
      },
      {
        "id": "1121",
        "label": "丽水市",
        "value": "331100",
      }
    ]
  },
  {
    "id": "12",
    "label": "安徽省",
    "value": "340000",
    "children": [
      {
        "id": "1122",
        "label": "合肥市",
        "value": "340100",
      },
      {
        "id": "1123",
        "label": "芜湖市",
        "value": "340200",
      },
      {
        "id": "1124",
        "label": "蚌埠市",
        "value": "340300",
      },
      {
        "id": "1125",
        "label": "淮南市",
        "value": "340400",
      },
      {
        "id": "1126",
        "label": "马鞍山市",
        "value": "340500",
      },
      {
        "id": "1127",
        "label": "淮北市",
        "value": "340600",
      },
      {
        "id": "1128",
        "label": "铜陵市",
        "value": "340700",
      },
      {
        "id": "1129",
        "label": "安庆市",
        "value": "340800",
      },
      {
        "id": "1130",
        "label": "黄山市",
        "value": "341000",
      },
      {
        "id": "1131",
        "label": "滁州市",
        "value": "341100",
      },
      {
        "id": "1132",
        "label": "阜阳市",
        "value": "341200",
      },
      {
        "id": "1133",
        "label": "宿州市",
        "value": "341300",
      },
      {
        "id": "1134",
        "label": "巢湖市",
        "value": "341400",
      },
      {
        "id": "1135",
        "label": "六安市",
        "value": "341500",
      },
      {
        "id": "1136",
        "label": "亳州市",
        "value": "341600",
      },
      {
        "id": "1137",
        "label": "池州市",
        "value": "341700",
      },
      {
        "id": "1138",
        "label": "宣城市",
        "value": "341800",
      }
    ]
  },
  {
    "id": "13",
    "label": "福建省",
    "value": "350000",
    "children": [
      {
        "id": "1139",
        "label": "福州市",
        "value": "350100",
      },
      {
        "id": "1140",
        "label": "厦门市",
        "value": "350200",
      },
      {
        "id": "1141",
        "label": "莆田市",
        "value": "350300",
      },
      {
        "id": "1142",
        "label": "三明市",
        "value": "350400",
      },
      {
        "id": "1143",
        "label": "泉州市",
        "value": "350500",
      },
      {
        "id": "1144",
        "label": "漳州市",
        "value": "350600",
      },
      {
        "id": "1145",
        "label": "南平市",
        "value": "350700",
      },
      {
        "id": "1146",
        "label": "龙岩市",
        "value": "350800",
      },
      {
        "id": "1147",
        "label": "宁德市",
        "value": "350900",
      }
    ]
  },
  {
    "id": "14",
    "label": "江西省",
    "value": "360000",
    "children": [
      {
        "id": "1148",
        "label": "南昌市",
        "value": "360100",
      },
      {
        "id": "1149",
        "label": "景德镇市",
        "value": "360200",
      },
      {
        "id": "1150",
        "label": "萍乡市",
        "value": "360300",
      },
      {
        "id": "1151",
        "label": "九江市",
        "value": "360400",
      },
      {
        "id": "1152",
        "label": "新余市",
        "value": "360500",
      },
      {
        "id": "1153",
        "label": "鹰潭市",
        "value": "360600",
      },
      {
        "id": "1154",
        "label": "赣州市",
        "value": "360700",
      },
      {
        "id": "1155",
        "label": "吉安市",
        "value": "360800",
      },
      {
        "id": "1156",
        "label": "宜春市",
        "value": "360900",
      },
      {
        "id": "1157",
        "label": "抚州市",
        "value": "361000",
      },
      {
        "id": "1158",
        "label": "上饶市",
        "value": "361100",
      }
    ]
  },
  {
    "id": "15",
    "label": "山东省",
    "value": "370000",
    "children": [
      {
        "id": "1159",
        "label": "济南市",
        "value": "370100",
      },
      {
        "id": "1160",
        "label": "青岛市",
        "value": "370200",
      },
      {
        "id": "1161",
        "label": "淄博市",
        "value": "370300",
      },
      {
        "id": "1162",
        "label": "枣庄市",
        "value": "370400",
      },
      {
        "id": "1163",
        "label": "东营市",
        "value": "370500",
      },
      {
        "id": "1164",
        "label": "烟台市",
        "value": "370600",
      },
      {
        "id": "1165",
        "label": "潍坊市",
        "value": "370700",
      },
      {
        "id": "1166",
        "label": "济宁市",
        "value": "370800",
      },
      {
        "id": "1167",
        "label": "泰安市",
        "value": "370900",
      },
      {
        "id": "1168",
        "label": "威海市",
        "value": "371000",
      },
      {
        "id": "1169",
        "label": "日照市",
        "value": "371100",
      },
      {
        "id": "1170",
        "label": "莱芜市",
        "value": "371200",
      },
      {
        "id": "1171",
        "label": "临沂市",
        "value": "371300",
      },
      {
        "id": "1172",
        "label": "德州市",
        "value": "371400",
      },
      {
        "id": "1173",
        "label": "聊城市",
        "value": "371500",
      },
      {
        "id": "1174",
        "label": "滨州市",
        "value": "371600",
      },
      {
        "id": "1175",
        "label": "菏泽市",
        "value": "371700",
      }
    ]
  },
  {
    "id": "16",
    "label": "河南省",
    "value": "410000",
    "children": [
      {
        "id": "1176",
        "label": "郑州市",
        "value": "410100",
      },
      {
        "id": "1177",
        "label": "开封市",
        "value": "410200",
      },
      {
        "id": "1178",
        "label": "洛阳市",
        "value": "410300",
      },
      {
        "id": "1179",
        "label": "平顶山市",
        "value": "410400",
      },
      {
        "id": "1180",
        "label": "安阳市",
        "value": "410500",
      },
      {
        "id": "1181",
        "label": "鹤壁市",
        "value": "410600",
      },
      {
        "id": "1182",
        "label": "新乡市",
        "value": "410700",
      },
      {
        "id": "1183",
        "label": "焦作市",
        "value": "410800",
      },
      {
        "id": "1184",
        "label": "濮阳市",
        "value": "410900",
      },
      {
        "id": "1185",
        "label": "许昌市",
        "value": "411000",
      },
      {
        "id": "1186",
        "label": "漯河市",
        "value": "411100",
      },
      {
        "id": "1187",
        "label": "三门峡市",
        "value": "411200",
      },
      {
        "id": "1188",
        "label": "南阳市",
        "value": "411300",
      },
      {
        "id": "1189",
        "label": "商丘市",
        "value": "411400",
      },
      {
        "id": "1190",
        "label": "信阳市",
        "value": "411500",
      },
      {
        "id": "1191",
        "label": "周口市",
        "value": "411600",
      },
      {
        "id": "1192",
        "label": "驻马店市",
        "value": "411700",
      },
      {
        "id": "1193",
        "label": "省直辖县级行政区划",
        "value": "419000",
      }
    ]
  },
  {
    "id": "17",
    "label": "湖北省",
    "value": "420000",
    "children": [
      {
        "id": "1194",
        "label": "武汉市",
        "value": "420100",
      },
      {
        "id": "1195",
        "label": "黄石市",
        "value": "420200",
      },
      {
        "id": "1196",
        "label": "十堰市",
        "value": "420300",
      },
      {
        "id": "1197",
        "label": "宜昌市",
        "value": "420500",
      },
      {
        "id": "1198",
        "label": "襄樊市",
        "value": "420600",
      },
      {
        "id": "1199",
        "label": "鄂州市",
        "value": "420700",
      },
      {
        "id": "1200",
        "label": "荆门市",
        "value": "420800",
      },
      {
        "id": "1201",
        "label": "孝感市",
        "value": "420900",
      },
      {
        "id": "1202",
        "label": "荆州市",
        "value": "421000",
      },
      {
        "id": "1203",
        "label": "黄冈市",
        "value": "421100",
      },
      {
        "id": "1204",
        "label": "咸宁市",
        "value": "421200",
      },
      {
        "id": "1205",
        "label": "随州市",
        "value": "421300",
      },
      {
        "id": "1206",
        "label": "恩施土家族苗族自治州",
        "value": "422800",
      },
      {
        "id": "1207",
        "label": "省直辖县级行政区划",
        "value": "429000",
      }
    ]
  },
  {
    "id": "18",
    "label": "湖南省",
    "value": "430000",
    "children": [
      {
        "id": "1208",
        "label": "长沙市",
        "value": "430100",
      },
      {
        "id": "1209",
        "label": "株洲市",
        "value": "430200",
      },
      {
        "id": "1210",
        "label": "湘潭市",
        "value": "430300",
      },
      {
        "id": "1211",
        "label": "衡阳市",
        "value": "430400",
      },
      {
        "id": "1212",
        "label": "邵阳市",
        "value": "430500",
      },
      {
        "id": "1213",
        "label": "岳阳市",
        "value": "430600",
      },
      {
        "id": "1214",
        "label": "常德市",
        "value": "430700",
      },
      {
        "id": "1215",
        "label": "张家界市",
        "value": "430800",
      },
      {
        "id": "1216",
        "label": "益阳市",
        "value": "430900",
      },
      {
        "id": "1217",
        "label": "郴州市",
        "value": "431000",
      },
      {
        "id": "1218",
        "label": "永州市",
        "value": "431100",
      },
      {
        "id": "1219",
        "label": "怀化市",
        "value": "431200",
      },
      {
        "id": "1220",
        "label": "娄底市",
        "value": "431300",
      },
      {
        "id": "1221",
        "label": "湘西土家族苗族自治州",
        "value": "433100",
      }
    ]
  },
  {
    "id": "19",
    "label": "广东省",
    "value": "440000",
    "children": [
      {
        "id": "1222",
        "label": "广州市",
        "value": "440100",
      },
      {
        "id": "1223",
        "label": "韶关市",
        "value": "440200",
      },
      {
        "id": "1224",
        "label": "深圳市",
        "value": "440300",
      },
      {
        "id": "1225",
        "label": "珠海市",
        "value": "440400",
      },
      {
        "id": "1226",
        "label": "汕头市",
        "value": "440500",
      },
      {
        "id": "1227",
        "label": "佛山市",
        "value": "440600",
      },
      {
        "id": "1228",
        "label": "江门市",
        "value": "440700",
      },
      {
        "id": "1229",
        "label": "湛江市",
        "value": "440800",
      },
      {
        "id": "1230",
        "label": "茂名市",
        "value": "440900",
      },
      {
        "id": "1231",
        "label": "肇庆市",
        "value": "441200",
      },
      {
        "id": "1232",
        "label": "惠州市",
        "value": "441300",
      },
      {
        "id": "1233",
        "label": "梅州市",
        "value": "441400",
      },
      {
        "id": "1234",
        "label": "汕尾市",
        "value": "441500",
      },
      {
        "id": "1235",
        "label": "河源市",
        "value": "441600",
      },
      {
        "id": "1236",
        "label": "阳江市",
        "value": "441700",
      },
      {
        "id": "1237",
        "label": "清远市",
        "value": "441800",
      },
      {
        "id": "1238",
        "label": "东莞市",
        "value": "441900",
      },
      {
        "id": "1239",
        "label": "中山市",
        "value": "442000",
      },
      {
        "id": "1240",
        "label": "潮州市",
        "value": "445100",
      },
      {
        "id": "1241",
        "label": "揭阳市",
        "value": "445200",
      },
      {
        "id": "1242",
        "label": "云浮市",
        "value": "445300",
      }
    ]
  },
  {
    "id": "20",
    "label": "广西",
    "value": "450000",
    "children": [
      {
        "id": "1243",
        "label": "南宁市",
        "value": "450100",
      },
      {
        "id": "1244",
        "label": "柳州市",
        "value": "450200",
      },
      {
        "id": "1245",
        "label": "桂林市",
        "value": "450300",
      },
      {
        "id": "1246",
        "label": "梧州市",
        "value": "450400",
      },
      {
        "id": "1247",
        "label": "北海市",
        "value": "450500",
      },
      {
        "id": "1248",
        "label": "防城港市",
        "value": "450600",
      },
      {
        "id": "1249",
        "label": "钦州市",
        "value": "450700",
      },
      {
        "id": "1250",
        "label": "贵港市",
        "value": "450800",
      },
      {
        "id": "1251",
        "label": "玉林市",
        "value": "450900",
      },
      {
        "id": "1252",
        "label": "百色市",
        "value": "451000",
      },
      {
        "id": "1253",
        "label": "贺州市",
        "value": "451100",
      },
      {
        "id": "1254",
        "label": "河池市",
        "value": "451200",
      },
      {
        "id": "1255",
        "label": "来宾市",
        "value": "451300",
      },
      {
        "id": "1256",
        "label": "崇左市",
        "value": "451400",
      }
    ]
  },
  {
    "id": "21",
    "label": "海南省",
    "value": "460000",
    "children": [
      {
        "id": "1257",
        "label": "海口市",
        "value": "460100",
      },
      {
        "id": "1258",
        "label": "三亚市",
        "value": "460200",
      },
      {
        "id": "1259",
        "label": "省直辖县级行政区划",
        "value": "469000",
      }
    ]
  },
  {
    "id": "22",
    "label": "四川省",
    "value": "510000",
    "children": [
      {
        "id": "1262",
        "label": "成都市",
        "value": "510100",
      },
      {
        "id": "1263",
        "label": "自贡市",
        "value": "510300",
      },
      {
        "id": "1264",
        "label": "攀枝花市",
        "value": "510400",
      },
      {
        "id": "1265",
        "label": "泸州市",
        "value": "510500",
      },
      {
        "id": "1266",
        "label": "德阳市",
        "value": "510600",
      },
      {
        "id": "1267",
        "label": "绵阳市",
        "value": "510700",
      },
      {
        "id": "1268",
        "label": "广元市",
        "value": "510800",
      },
      {
        "id": "1269",
        "label": "遂宁市",
        "value": "510900",
      },
      {
        "id": "1270",
        "label": "内江市",
        "value": "511000",
      },
      {
        "id": "1271",
        "label": "乐山市",
        "value": "511100",
      },
      {
        "id": "1272",
        "label": "南充市",
        "value": "511300",
      },
      {
        "id": "1273",
        "label": "眉山市",
        "value": "511400",
      },
      {
        "id": "1274",
        "label": "宜宾市",
        "value": "511500",
      },
      {
        "id": "1275",
        "label": "广安市",
        "value": "511600",
      },
      {
        "id": "1276",
        "label": "达州市",
        "value": "511700",
      },
      {
        "id": "1277",
        "label": "雅安市",
        "value": "511800",
      },
      {
        "id": "1278",
        "label": "巴中市",
        "value": "511900",
      },
      {
        "id": "1279",
        "label": "资阳市",
        "value": "512000",
      },
      {
        "id": "1280",
        "label": "阿坝藏族羌族自治州",
        "value": "513200",
      },
      {
        "id": "1281",
        "label": "甘孜藏族自治州",
        "value": "513300",
      },
      {
        "id": "1282",
        "label": "凉山彝族自治州",
        "value": "513400",
      }
    ]
  },
  {
    "id": "23",
    "label": "贵州省",
    "value": "520000",
    "children": [
      {
        "id": "1283",
        "label": "贵阳市",
        "value": "520100",
      },
      {
        "id": "1284",
        "label": "六盘水市",
        "value": "520200",
      },
      {
        "id": "1285",
        "label": "遵义市",
        "value": "520300",
      },
      {
        "id": "1286",
        "label": "安顺市",
        "value": "520400",
      },
      {
        "id": "1287",
        "label": "铜仁地区",
        "value": "522200",
      },
      {
        "id": "1288",
        "label": "黔西南布依族苗族自治州",
        "value": "522300",
      },
      {
        "id": "1289",
        "label": "毕节地区",
        "value": "522400",
      },
      {
        "id": "1290",
        "label": "黔东南苗族侗族自治州",
        "value": "522600",
      },
      {
        "id": "1291",
        "label": "黔南布依族苗族自治州",
        "value": "522700",
      }
    ]
  },
  {
    "id": "24",
    "label": "云南省",
    "value": "530000",
    "children": [
      {
        "id": "1292",
        "label": "昆明市",
        "value": "530100",
      },
      {
        "id": "1293",
        "label": "曲靖市",
        "value": "530300",
      },
      {
        "id": "1294",
        "label": "玉溪市",
        "value": "530400",
      },
      {
        "id": "1295",
        "label": "保山市",
        "value": "530500",
      },
      {
        "id": "1296",
        "label": "昭通市",
        "value": "530600",
      },
      {
        "id": "1297",
        "label": "丽江市",
        "value": "530700",
      },
      {
        "id": "1298",
        "label": "普洱市",
        "value": "530800",
      },
      {
        "id": "1299",
        "label": "临沧市",
        "value": "530900",
      },
      {
        "id": "1300",
        "label": "楚雄彝族自治州",
        "value": "532300",
      },
      {
        "id": "1301",
        "label": "红河哈尼族彝族自治州",
        "value": "532500",
      },
      {
        "id": "1302",
        "label": "文山壮族苗族自治州",
        "value": "532600",
      },
      {
        "id": "1303",
        "label": "西双版纳傣族自治州",
        "value": "532800",
      },
      {
        "id": "1304",
        "label": "大理白族自治州",
        "value": "532900",
      },
      {
        "id": "1305",
        "label": "德宏傣族景颇族自治州",
        "value": "533100",
      },
      {
        "id": "1306",
        "label": "怒江傈僳族自治州",
        "value": "533300",
      },
      {
        "id": "1307",
        "label": "迪庆藏族自治州",
        "value": "533400",
      }
    ]
  },
  {
    "id": "25",
    "label": "陕西省",
    "value": "610000",
    "children": [
      {
        "id": "1315",
        "label": "西安市",
        "value": "610100",
      },
      {
        "id": "1316",
        "label": "铜川市",
        "value": "610200",
      },
      {
        "id": "1317",
        "label": "宝鸡市",
        "value": "610300",
      },
      {
        "id": "1318",
        "label": "咸阳市",
        "value": "610400",
      },
      {
        "id": "1319",
        "label": "渭南市",
        "value": "610500",
      },
      {
        "id": "1320",
        "label": "延安市",
        "value": "610600",
      },
      {
        "id": "1321",
        "label": "汉中市",
        "value": "610700",
      },
      {
        "id": "1322",
        "label": "榆林市",
        "value": "610800",
      },
      {
        "id": "1323",
        "label": "安康市",
        "value": "610900",
      },
      {
        "id": "1324",
        "label": "商洛市",
        "value": "611000",
      }
    ]
  },
  {
    "id": "26",
    "label": "甘肃省",
    "value": "620000",
    "children": [
      {
        "id": "1325",
        "label": "兰州市",
        "value": "620100",
      },
      {
        "id": "1326",
        "label": "嘉峪关市",
        "value": "620200",
      },
      {
        "id": "1327",
        "label": "金昌市",
        "value": "620300",
      },
      {
        "id": "1328",
        "label": "白银市",
        "value": "620400",
      },
      {
        "id": "1329",
        "label": "天水市",
        "value": "620500",
      },
      {
        "id": "1330",
        "label": "武威市",
        "value": "620600",
      },
      {
        "id": "1331",
        "label": "张掖市",
        "value": "620700",
      },
      {
        "id": "1332",
        "label": "平凉市",
        "value": "620800",
      },
      {
        "id": "1333",
        "label": "酒泉市",
        "value": "620900",
      },
      {
        "id": "1334",
        "label": "庆阳市",
        "value": "621000",
      },
      {
        "id": "1335",
        "label": "定西市",
        "value": "621100",
      },
      {
        "id": "1336",
        "label": "陇南市",
        "value": "621200",
      },
      {
        "id": "1337",
        "label": "临夏回族自治州",
        "value": "622900",
      },
      {
        "id": "1338",
        "label": "甘南藏族自治州",
        "value": "623000",
      }
    ]
  },
  {
    "id": "27",
    "label": "宁夏",
    "value": "640000",
    "children": [
      {
        "id": "1347",
        "label": "银川市",
        "value": "640100",
      },
      {
        "id": "1348",
        "label": "石嘴山市",
        "value": "640200",
      },
      {
        "id": "1349",
        "label": "吴忠市",
        "value": "640300",
      },
      {
        "id": "1350",
        "label": "固原市",
        "value": "640400",
      },
      {
        "id": "1351",
        "label": "中卫市",
        "value": "640500",
      }
    ]
  },
  {
    "id": "28",
    "label": "青海省",
    "value": "630000",
    "children": [
      {
        "id": "1339",
        "label": "西宁市",
        "value": "630100",
      },
      {
        "id": "1340",
        "label": "海东地区",
        "value": "632100",
      },
      {
        "id": "1341",
        "label": "海北藏族自治州",
        "value": "632200",
      },
      {
        "id": "1342",
        "label": "黄南藏族自治州",
        "value": "632300",
      },
      {
        "id": "1343",
        "label": "海南藏族自治州",
        "value": "632500",
      },
      {
        "id": "1344",
        "label": "果洛藏族自治州",
        "value": "632600",
      },
      {
        "id": "1345",
        "label": "玉树藏族自治州",
        "value": "632700",
      },
      {
        "id": "1346",
        "label": "海西蒙古族藏族自治州",
        "value": "632800",
      }
    ]
  },
  {
    "id": "29",
    "label": "新疆",
    "value": "650000",
    "children": [
      {
        "id": "1352",
        "label": "乌鲁木齐市",
        "value": "650100",
      },
      {
        "id": "1353",
        "label": "克拉玛依市",
        "value": "650200",
      },
      {
        "id": "1354",
        "label": "吐鲁番地区",
        "value": "652100",
      },
      {
        "id": "1355",
        "label": "哈密地区",
        "value": "652200",
      },
      {
        "id": "1356",
        "label": "昌吉回族自治州",
        "value": "652300",
      },
      {
        "id": "1357",
        "label": "博尔塔拉蒙古自治州",
        "value": "652700",
      },
      {
        "id": "1358",
        "label": "巴音郭楞蒙古自治州",
        "value": "652800",
      },
      {
        "id": "1359",
        "label": "阿克苏地区",
        "value": "652900",
      },
      {
        "id": "1360",
        "label": "克孜勒苏柯尔克孜自治州",
        "value": "653000",
      },
      {
        "id": "1361",
        "label": "喀什地区",
        "value": "653100",
      },
      {
        "id": "1362",
        "label": "和田地区",
        "value": "653200",
      },
      {
        "id": "1363",
        "label": "伊犁哈萨克自治州",
        "value": "654000",
      },
      {
        "id": "1364",
        "label": "塔城地区",
        "value": "654200",
      },
      {
        "id": "1365",
        "label": "阿勒泰地区",
        "value": "654300",
      },
      {
        "id": "1366",
        "label": "自治区直辖县级行政区划",
        "value": "659000",
      }
    ]
  },
  {
    "id": "30",
    "label": "西藏",
    "value": "540000",
    "children": [
      {
        "id": "1308",
        "label": "拉萨市",
        "value": "540100",
      },
      {
        "id": "1309",
        "label": "昌都地区",
        "value": "542100",
      },
      {
        "id": "1310",
        "label": "山南地区",
        "value": "542200",
      },
      {
        "id": "1311",
        "label": "日喀则地区",
        "value": "542300",
      },
      {
        "id": "1312",
        "label": "那曲地区",
        "value": "542400",
      },
      {
        "id": "1313",
        "label": "阿里地区",
        "value": "542500",
      },
      {
        "id": "1314",
        "label": "林芝地区",
        "value": "542600",
      }
    ]
  },
  {
    "id": "31",
    "label": "台湾省",
    "value": "710000",
    "children" : [{
      "id": "31",
      "label": "台湾省",
      "value": "710000",
      "children" : [{
        "id": "31",
        "label": "台湾省",
        "value": "710000",
      }]
    }]
  },
  {
    "id": "32",
    "label": "香港",
    "value": "810000",
    "children" : [{
      "id": "32",
      "label": "香港",
      "value": "810000",
    }]
  },
  {
    "id": "33",
    "label": "澳门",
    "value": "820000",
    "children" : [{
      "id": "33",
      "label": "澳门",
      "value": "820000",
    }]

  },
  // {
  //   "id": "37",
  //   "label": "外籍",
  //   "value": "998",
  //   "children": [
  //     {
  //       "id": "1367",
  //       "label": "外籍",
  //       "value": "WJ",
  //       "children": [
  //         {
  //           "id": "1367",
  //           "label": "外籍",
  //           "value": "WJ",
  //
  //         }
  //       ]
  //     }
  //   ]
  // }
]
export const bankList =
    ["工商银行", "焦作中旅银行股份有限公司", "贵州省农村信用社联合社", "农业银行", "汉口银行资金清算中心", "云南省农村信用社联合社", "中国银行", 
    "湖北银行股份有限公司", "陕西省农村信用社联合社资金清算中心", "建设银行", "华融湘江银行股份有限公司", "甘肃省农村合作金融结算服务中心", "开发银行", 
    "长沙银行股份有限公司", "青海省农村信用社资金清算中心", "中国进出口银行", "广州银行股份有限公司清算中心", "宁夏黄河农村商业银行股份有限公司", "农业发展银行", 
    "珠海华润银行股份有限公司清算中心", "新疆维吾尔自治区农村信用社联合社", "交通银行", "广东华兴银行股份有限公司", "邮政储蓄银行", "中信银行",
     "广东南粤银行股份有限公司", "汇丰银行(中国)有限公司上海分行", "光大银行", "东莞银行股份有限公司", "东亚银行（中国）有限公司", "中国华夏", 
     "广西北部湾银行股份有限公司", "南洋商业银行（中国）有限公司", "民生银行", "柳州银行股份有限公司清算中心", "恒生银行(中国)有限公司上海分行", "广发银行", 
     "桂林银行股份有限公司", "集友银行有限公司福州分行", "平安银行", "海南银行股份有限公司", "创兴银行有限公司汕头分行", "招商银行", "成都银行", 
     "大众银行（香港）有限公司深圳分行", "兴业银行", "重庆银行", "永隆银行有限公司深圳分行", "上海浦东发展银行", "自贡银行股份有限公司", 
     "大新银行（中国）有限公司", "北京银行", "攀枝花市商业银行", "中信银行国际（中国）有限公司", "天津银行", "泸州市商业银行", 
     "国泰世华商业银行股份有限公司上海分行", "河北银行", "长城华西银行股份有限公司", "合作金库商业银行股份有限公司苏州分行", "唐山银行",
      "绵阳市商业银行", "第一商业银行股份有限公司上海分行", "秦皇岛银行", "遂宁银行", "花旗银行(中国)有限公司", "邯郸银行", "乐山市商业银行", 
      "美国银行有限公司上海分行", "邢台银行", "宜宾市商业银行", "摩根大通银行(中国)有限公司", "保定银行", "四川天府银行股份有限公司", 
      "美国建东银行有限公司厦门分行", "张家口银行", "达州银行股份有限公司", "三菱东京日联银行（中国）有限公司上海分行", "承德银行", "雅安市商业银行股份有限公司", 
      "三井住友银行(中国)有限公司", "沧州银行", "凉山州商业银行", "瑞穗银行（中国）有限公司", "廊坊银行", "贵阳银行股份有限公司", "日本山口银行股份有限公司青岛分行",
       "衡水银行", "贵州银行股份有限公司", "日本三井住友信托银行股份有限公司上海分行", "晋商银行", "富滇银行股份有限公司运营管理部", "友利银行(中国)有限公司", 
       "大同银行", "曲靖市商业银行", "韩国产业银行上海分行", "阳泉市商业银行股份有限公司", "云南红塔银行股份有限公司", "新韩银行(中国)有限公司", "长治银行", 
       "西藏银行股份有限公司", "企业银行（中国）有限公司", "晋城银行", "西安银行股份有限公司", "韩亚银行(中国)有限公司", "晋中银行", "长安银行股份有限公司", 
       "国民银行（中国）有限公司", "内蒙古银行", "兰州银行股份有限公司", "马来西亚马来亚银行有限公司上海分行", "包商银行", "甘肃银行股份有限公司", 
       "首都银行（中国）有限公司", "乌海银行", "青海银行股份有限公司", "华侨永亨银行（中国）有限公司", "鄂尔多斯银行", "宁夏银行总行清算中心", 
       "大华银行（中国）有限公司上海分行", "盛京银行", "石嘴山银行股份有限公司", "星展银行（中国）有限公司上海分行", "大连银行", "乌鲁木齐银行清算中心", 
       "盘谷银行(中国)有限公司", "鞍山银行", "昆仑银行股份有限公司", "奥地利奥合国际银行股份有限公司北京分行", "抚顺银行", "哈密市商业银行股份有限公司", 
       "比利时联合银行股份有限公司上海分行", "本溪市商业银行", "库尔勒银行股份有限公司", "荷兰安智银行股份有限公司上海分行", "丹东银行", "新疆汇和银行", 
       "渣打银行（中国）有限公司上海分行", "锦州银行", "天津滨海农村商业银行股份有限公司", "英国巴克莱银行有限公司上海分行", "葫芦岛银行", "大连农村商业银行", 
       "瑞典商业银行公共有限公司上海分行", "营口银行", "无锡农村银行", "瑞典北欧斯安银行有限公司上海分行", "营口沿海银行", "江苏江阴银行", "瑞典银行有限公司上海分行", 
       "阜新银行", "江苏江南银行", "法国兴业银行(中国)有限公司", "辽阳银行", "太仓农村商业银行", "东方汇理银行（中国）有限公司上海分行", "盘锦银行", "昆山农村商业银行", 
       "法国外贸银行股份有限公司上海分行", "铁岭银行", "吴江农村商业银行清算中心", "德意志银行（中国）有限公司", "朝阳银行", "江苏常熟农村商业银行股份有限公司清算中心", "德国商业银行股份有限公司上海分行", "吉林银行", 
       "张家港农村商业银行", "德国北德意志州银行上海分行", "哈尔滨银行", "广州农村商业银行股份有限公司", "中德住房储蓄银行",
        "龙江银行", "广东顺德农村商业银行股份有限公司", "意大利裕信银行股份有限公司上海分行", "南京银行", "海口联合农村商业银行股份有限公司", "意大利联合圣保罗银行股份有限公司上海分行", "江苏银行", "成都农商银行", "瑞士信贷银行股份有限公司上海分行", 
        "苏州银行", "重庆农村银行", "瑞士银行(中国)有限公司", "江苏长江商业银行", "恒丰银行", "加拿大丰业银行有限公司广州分行", "杭州银行股份有限公司", "浙商银行", "蒙特利尔银行（中国）有限公司广州分行", "宁波东海银行", "天津农村商业银行股份有限公司", 
        "澳大利亚和新西兰银行(中国)有限公司上海分行", "宁波银行股份有限公司", "渤海银行股份有限公司", "澳大利亚西太平洋银行有限公司上海分行", 
        "宁波通商银行股份有限公司", "徽商银行股份有限公司", "摩根士丹利国际银行（中国）有限公司", "温州银行股份有限公司营业部", "重庆三峡银行股份有限公司", 
        "华美银行(中国)有限公司", "嘉兴银行股份有限公司清算中心", "上海农商银行", "荷兰合作银行有限公司上海分行", "湖州银行股份有限公司清算中心", "天津金城银行股份有限公司", "厦门国际银行股份有限公司", "绍兴银行股份有限公司营业部", "上海华瑞银行", 
        "法国巴黎银行（中国）有限公司", "金华银行股份有限公司", "浙江网商银行股份有限公司", "富邦华一银行有限公司", "浙江稠州商业银行", "温州民商银行股份有限公司", 
        "中央结算公司", "台州银行股份有限公司", "深圳前海微众银行股份有限公司", "公开市场业务操作室", "浙江泰隆商业银行清算中心", "四川新网银行股份有限公司", 
        "中国外汇交易中心北京备份中心", "浙江民泰商业银行股份有限公司", "重庆富民银行股份有限公司", "中国外汇交易中心", "福建海峡银行股份有限公司", 
        "上海银行股份有限公司", "中国外汇交易中心清算部", "厦门银行股份有限公司", "北京农村商业银行股份有限公司", "城市商业银行资金清算中心", "泉州银行股份有限公司",
         "河北省农村信用社联合社", "中国银联股份有限公司", "江西银行股份有限公司", "山西省农村信用社联合社", "天津集中代收付中心", "九江银行股份有限公司", 
         "内蒙古自治区农村信用社联合社", "河北省集中代收付中心", "赣州银行股份有限公司", "辽宁省农村信用社联合社运营管理部", "山西省集中代收付中心", 
         "上饶银行清算中心", "吉林省农村信用社联合社", "内蒙古自治区集中代收付中心", "齐鲁银行", "黑龙江省农村信用社清算中心", "沈阳市银行电子结算中心", 
         "青岛银行", "江苏省农村信用社联合社", "大连资金清算中心", "齐商银行", "浙江省农村信用社联合社", "哈尔滨金融电子结算中心", "枣庄银行",
          "宁波鄞州农村商业银行股份有限公司", "江苏省集中代收付中心", "东营银行", "安徽省农村信用社联合社资金清算中心", "杭州金融清算中心", "烟台银行", 
          "福建省农村信用社联合社", "江西省集中代收付中心", "潍坊银行", "江西省农村信用社联合社", "湖南银信金融电子服务有限公司支票圈存运营中心", "济宁银行", 
          "山东省农村信用社联合社", "广州银行电子结算中心", "泰安银行", "河南省农村信用社联合社资金清算中心", "深圳集中代收付中心", "莱商银行", 
          "湖北省农村信用社联合社结算中心", "昆明银行电子结算中心", "威海银行", "武汉农村商业银行股份有限公司", "西安金融电子结算中心", "德州银行",
           "湖南省农村信用社联合社", "兵工财务有限责任公司", "临商银行", "广东省农村信用社联合社", "上海汽车集团财务有限责任公司", "日照银行",
            "深圳农村商业银行股份有限公司", "宝钢集团财务有限责任公司", "郑州银行", "东莞农村商业银行股份有限公司", "海尔集团财务有限责任公司", "中原银行",
             "广西壮族自治区农村信用社联合社", "海信集团财务有限公司", "洛阳银行", "海南省农村信用社联合社资金清算中心", "中国一拖集团财务有限责任公司", 
             "平顶山银行股份有限公司", "四川省农村信用社联合社", "美的集团财务有限公司", "人民币跨境支付系统", "上海票据交易所股份有限公司", "电子商业汇票系统处理中心",
              "网联清算有限公司", "银行间市场清算所 "];


let dongbei = ['黑龙江省', '吉林省', '辽宁省'];
let huadong = ['上海市', '江苏省', '浙江省', '安徽省', '福建省', '江西省', '山东省'];

let huabei = ['北京市', '天津市', '山西省', '河北省', '内蒙古'];

let huazhong = ['河南省', '湖北省', '湖南省'];

let huanan = ['广东省', '广西', '海南省'];



let xinan = ['重庆市', '四川省', '贵州省', '云南省','西藏'];


let xibei = ['陕西省', '甘肃省', '青海省', '宁夏', '新疆'];
let ganAoTai = ['台湾省', '香港', '澳门'];
let NewArray = [{
    "id": "9859",
    "label": "东北",
    "value": "1",
    "children": []
},
{
    "id": "9860",
    "label": "华东",
    "value": "2",
    "children": []
},
{
    "id": "9861",
    "label": "华中",
    "value": "3",
    "children": []
},
{
    "id": "9862",
    "label": "华南",
    "value": "4",
    "children": []
},
{
    "id": "9863",
    "label": "华北",
    "value": "5",
    "children": []
},
{
    "id": "9864",
    "label": "西北",
    "value": "6",
    "children": []
},
{
    "id": "9865",
    "label": "西南",
    "value": "7",
    "children": []
},
{
    "id": "9866",
    "label": "港澳台",
    "value": "8",
    "children": []
}
];
CityData.map((item, index) => {
  if (dongbei.indexOf(item.label) > -1) {
    NewArray[0].children.push(item)
  }
  else if (huadong.indexOf(item.label) > -1) {
    NewArray[1].children.push(item)
  }
  else if (huazhong.indexOf(item.label) > -1) {
    NewArray[2].children.push(item)
  }
  else if (huanan.indexOf(item.label) > -1) {
    NewArray[3].children.push(item)
  }
  else if (huabei.indexOf(item.label) > -1) {
    NewArray[4].children.push(item)
  }
  else if (xinan.indexOf(item.label) > -1) {
    NewArray[6].children.push(item)
  }
  else if (xibei.indexOf(item.label) > -1) {
    NewArray[5].children.push(item)
  }
  else if (ganAoTai.indexOf(item.label) > -1) {
    NewArray[7].children.push(item)
  }
    // return NewArray;
});
let Region = [{
    "id": "6598",
    "label": "全选",
    "value": "9",
    "children": NewArray
}]
export const CitySevenRegion = Region;
